Masmiseim36/nxpSDK/boards/frdmimxrt1186/driver_examples/cache/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_BISSPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: G3, peripheral: FLEXIO1, signal: 'IO, 00', pin_signal: GPIO_EMC_B1_00, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: G2, peripheral: FLEXIO1, signal: 'IO, 02', pin_signal: GPIO_EMC_B1_02, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_BISSPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIO_BISSPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00, /* GPIO_EMC_B1_00 is configured as FLEXIO1_FLEXIO00 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_00 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02, /* GPIO_EMC_B1_02 is configured as FLEXIO1_FLEXIO02 */
      1U);
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00, /* GPIO_EMC_B1_00 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02, /* GPIO_EMC_B1_02 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXSPI_FLRPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: F14, peripheral: FLEXSPI_SLV, signal: CLK, pin_signal: GPIO_SD_B2_07}
  - {pin_num: G13, peripheral: FLEXSPI_SLV, signal: CS, pin_signal: GPIO_SD_B2_06}
  - {pin_num: F12, peripheral: FLEXSPI_SLV, signal: DQS, pin_signal: GPIO_SD_B2_05}
  - {pin_num: E13, peripheral: FLEXSPI_SLV, signal: 'DATA, 0', pin_signal: GPIO_SD_B2_08}
  - {pin_num: G14, peripheral: FLEXSPI_SLV, signal: 'DATA, 1', pin_signal: GPIO_SD_B2_09}
  - {pin_num: H13, peripheral: FLEXSPI_SLV, signal: 'DATA, 2', pin_signal: GPIO_SD_B2_10}
  - {pin_num: F13, peripheral: FLEXSPI_SLV, signal: 'DATA, 3', pin_signal: GPIO_SD_B2_11}
  - {pin_num: J11, peripheral: FLEXSPI_SLV, signal: 'DATA, 4', pin_signal: GPIO_SD_B2_00}
  - {pin_num: H11, peripheral: FLEXSPI_SLV, signal: 'DATA, 5', pin_signal: GPIO_SD_B2_01}
  - {pin_num: H14, peripheral: FLEXSPI_SLV, signal: 'DATA, 6', pin_signal: GPIO_SD_B2_02}
  - {pin_num: F11, peripheral: FLEXSPI_SLV, signal: 'DATA, 7', pin_signal: GPIO_SD_B2_03}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXSPI_FLRPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXSPI_FLRPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_00_XSPI_SLV_DATA04,   /* GPIO_SD_B2_00 is configured as XSPI_SLV_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_01_XSPI_SLV_DATA05,   /* GPIO_SD_B2_01 is configured as XSPI_SLV_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_02_XSPI_SLV_DATA06,   /* GPIO_SD_B2_02 is configured as XSPI_SLV_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_03_XSPI_SLV_DATA07,   /* GPIO_SD_B2_03 is configured as XSPI_SLV_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_05_XSPI_SLV_DQS,      /* GPIO_SD_B2_05 is configured as XSPI_SLV_DQS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_06_XSPI_SLV_CS,       /* GPIO_SD_B2_06 is configured as XSPI_SLV_CS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_07_XSPI_SLV_CLK,      /* GPIO_SD_B2_07 is configured as XSPI_SLV_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_08_XSPI_SLV_DATA00,   /* GPIO_SD_B2_08 is configured as XSPI_SLV_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_09_XSPI_SLV_DATA01,   /* GPIO_SD_B2_09 is configured as XSPI_SLV_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_10_XSPI_SLV_DATA02,   /* GPIO_SD_B2_10 is configured as XSPI_SLV_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_11_XSPI_SLV_DATA03,   /* GPIO_SD_B2_11 is configured as XSPI_SLV_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


