Masmiseim36/nxpSDK/boards/frdmimxrt1186/driver_examples/cache/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSB_PDI2CPins:
- options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: N7, peripheral: LPI2C3, signal: SCL, pin_signal: GPIO_EMC_B2_19, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: Normal_Driver,
    open_drain: Enable}
  - {pin_num: M8, peripheral: LPI2C3, signal: SDA, pin_signal: GPIO_EMC_B2_20, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: Normal_Driver,
    open_drain: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSB_PDI2CPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSB_PDI2CPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_19_LPI2C3_SCL,       /* GPIO_EMC_B2_19 is configured as LPI2C3_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_19 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_20_LPI2C3_SDA,       /* GPIO_EMC_B2_20 is configured as LPI2C3_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_20 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_19_LPI2C3_SCL,       /* GPIO_EMC_B2_19 PAD functional properties : */
      0x1AU);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_20_LPI2C3_SDA,       /* GPIO_EMC_B2_20 PAD functional properties : */
      0x1AU);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Enabled */
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSB_PDI2CPins_deinit, assigned for the Cortex-M33 core.
 * Description   : This is a de-initialization function for 'BOARD_InitUSB_PDI2CPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSB_PDI2CPins_deinit(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration on GPIO_EMC_B2_19 (pin N7) */
  rgpio_pin_config_t gpio3_pinN7_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_19 (pin N7) */
  RGPIO_PinInit(RGPIO3, 29U, &gpio3_pinN7_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B2_19 (pin N7) */
  RGPIO_SetPinInterruptConfig(RGPIO3, 29U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration on GPIO_EMC_B2_20 (pin M8) */
  rgpio_pin_config_t gpio3_pinM8_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_20 (pin M8) */
  RGPIO_PinInit(RGPIO3, 30U, &gpio3_pinM8_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B2_20 (pin M8) */
  RGPIO_SetPinInterruptConfig(RGPIO3, 30U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_19_GPIO3_IO29,       /* GPIO_EMC_B2_19 is configured as GPIO3_IO29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_20_GPIO3_IO30,       /* GPIO_EMC_B2_20 is configured as GPIO3_IO30 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_19_GPIO3_IO29,       /* GPIO_EMC_B2_19 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_20_GPIO3_IO30,       /* GPIO_EMC_B2_20 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSRAMCPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: G3, peripheral: SRAMC, signal: 'DATA, 0', pin_signal: GPIO_EMC_B1_00, pdrv_config: High_Driver}
  - {pin_num: F5, peripheral: SRAMC, signal: 'DATA, 1', pin_signal: GPIO_EMC_B1_01, pdrv_config: High_Driver}
  - {pin_num: G2, peripheral: SRAMC, signal: 'DATA, 2', pin_signal: GPIO_EMC_B1_02, pdrv_config: High_Driver}
  - {pin_num: E6, peripheral: SRAMC, signal: 'DATA, 3', pin_signal: GPIO_EMC_B1_03, pdrv_config: High_Driver}
  - {pin_num: H5, peripheral: SRAMC, signal: 'DATA, 4', pin_signal: GPIO_EMC_B1_04, pdrv_config: High_Driver}
  - {pin_num: E1, peripheral: SRAMC, signal: 'DATA, 5', pin_signal: GPIO_EMC_B1_05, pdrv_config: High_Driver}
  - {pin_num: H4, peripheral: SRAMC, signal: 'DATA, 6', pin_signal: GPIO_EMC_B1_06, pdrv_config: High_Driver}
  - {pin_num: J5, peripheral: SRAMC, signal: 'DATA, 7', pin_signal: GPIO_EMC_B1_07, pdrv_config: High_Driver}
  - {pin_num: F2, peripheral: SRAMC, signal: 'DATA, 8', pin_signal: GPIO_EMC_B1_30, pdrv_config: High_Driver}
  - {pin_num: F1, peripheral: SRAMC, signal: 'DATA, 9', pin_signal: GPIO_EMC_B1_31, pdrv_config: High_Driver}
  - {pin_num: G1, peripheral: SRAMC, signal: 'DATA, 10', pin_signal: GPIO_EMC_B1_32, pdrv_config: High_Driver}
  - {pin_num: H1, peripheral: SRAMC, signal: 'DATA, 11', pin_signal: GPIO_EMC_B1_33, pdrv_config: High_Driver}
  - {pin_num: H3, peripheral: SRAMC, signal: 'DATA, 12', pin_signal: GPIO_EMC_B1_34, pdrv_config: High_Driver}
  - {pin_num: H2, peripheral: SRAMC, signal: 'DATA, 13', pin_signal: GPIO_EMC_B1_35, pdrv_config: High_Driver}
  - {pin_num: J2, peripheral: SRAMC, signal: 'DATA, 14', pin_signal: GPIO_EMC_B1_36, pdrv_config: High_Driver}
  - {pin_num: J1, peripheral: SRAMC, signal: 'DATA, 15', pin_signal: GPIO_EMC_B1_37, pdrv_config: High_Driver}
  - {pin_num: J7, peripheral: SRAMC, signal: sramc_we, pin_signal: GPIO_EMC_B1_26, pdrv_config: High_Driver}
  - {pin_num: G5, peripheral: SRAMC, signal: sramc_oeb, pin_signal: GPIO_EMC_B1_27, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
  - {pin_num: D5, peripheral: SRAMC, signal: sramc_adv, pin_signal: GPIO_EMC_B1_28, pdrv_config: High_Driver}
  - {pin_num: C3, peripheral: SRAMC, signal: 'CS, 0', pin_signal: GPIO_EMC_B1_29, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

