Masmiseim36/nxpSDK/boards/frdmimxrt1186/driver_examples/cache/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSRAMC_FLEXIOPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: G3, peripheral: FLEXIO1, signal: 'IO, 00', pin_signal: GPIO_EMC_B1_00, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: F5, peripheral: FLEXIO1, signal: 'IO, 01', pin_signal: GPIO_EMC_B1_01, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: G2, peripheral: FLEXIO1, signal: 'IO, 02', pin_signal: GPIO_EMC_B1_02, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: E6, peripheral: FLEXIO1, signal: 'IO, 03', pin_signal: GPIO_EMC_B1_03, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: H5, peripheral: FLEXIO1, signal: 'IO, 04', pin_signal: GPIO_EMC_B1_04, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: E1, peripheral: FLEXIO1, signal: 'IO, 05', pin_signal: GPIO_EMC_B1_05, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: H4, peripheral: FLEXIO1, signal: 'IO, 06', pin_signal: GPIO_EMC_B1_06, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: J5, peripheral: FLEXIO1, signal: 'IO, 07', pin_signal: GPIO_EMC_B1_07, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: F3, peripheral: FLEXIO1, signal: 'IO, 08', pin_signal: GPIO_EMC_B1_08, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: A2, peripheral: FLEXIO1, signal: 'IO, 09', pin_signal: GPIO_EMC_B1_09, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: C2, peripheral: FLEXIO1, signal: 'IO, 10', pin_signal: GPIO_EMC_B1_10, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: D3, peripheral: FLEXIO1, signal: 'IO, 11', pin_signal: GPIO_EMC_B1_11, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: E5, peripheral: FLEXIO1, signal: 'IO, 12', pin_signal: GPIO_EMC_B1_12, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: E3, peripheral: FLEXIO1, signal: 'IO, 13', pin_signal: GPIO_EMC_B1_13, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: F4, peripheral: FLEXIO1, signal: 'IO, 14', pin_signal: GPIO_EMC_B1_14, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: D1, peripheral: FLEXIO1, signal: 'IO, 15', pin_signal: GPIO_EMC_B1_15, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: E2, peripheral: FLEXIO1, signal: 'IO, 16', pin_signal: GPIO_EMC_B1_16, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: B1, peripheral: FLEXIO1, signal: 'IO, 17', pin_signal: GPIO_EMC_B1_17, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: B2, peripheral: FLEXIO1, signal: 'IO, 18', pin_signal: GPIO_EMC_B1_18, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: E4, peripheral: FLEXIO1, signal: 'IO, 19', pin_signal: GPIO_EMC_B1_19, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSRAMC_FLEXIOPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSRAMC_FLEXIOPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00,  /* GPIO_EMC_B1_00 is configured as FLEXIO1_FLEXIO00 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_00 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_FLEXIO1_FLEXIO01,  /* GPIO_EMC_B1_01 is configured as FLEXIO1_FLEXIO01 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_01 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02,  /* GPIO_EMC_B1_02 is configured as FLEXIO1_FLEXIO02 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_02 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_FLEXIO1_FLEXIO03,  /* GPIO_EMC_B1_03 is configured as FLEXIO1_FLEXIO03 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_03 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_FLEXIO1_FLEXIO04,  /* GPIO_EMC_B1_04 is configured as FLEXIO1_FLEXIO04 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_04 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_05_FLEXIO1_FLEXIO05,  /* GPIO_EMC_B1_05 is configured as FLEXIO1_FLEXIO05 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_05 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_06_FLEXIO1_FLEXIO06,  /* GPIO_EMC_B1_06 is configured as FLEXIO1_FLEXIO06 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_06 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_07_FLEXIO1_FLEXIO07,  /* GPIO_EMC_B1_07 is configured as FLEXIO1_FLEXIO07 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_07 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_08_FLEXIO1_FLEXIO08,  /* GPIO_EMC_B1_08 is configured as FLEXIO1_FLEXIO08 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_08 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_09_FLEXIO1_FLEXIO09,  /* GPIO_EMC_B1_09 is configured as FLEXIO1_FLEXIO09 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_09 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_10_FLEXIO1_FLEXIO10,  /* GPIO_EMC_B1_10 is configured as FLEXIO1_FLEXIO10 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_10 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_11_FLEXIO1_FLEXIO11,  /* GPIO_EMC_B1_11 is configured as FLEXIO1_FLEXIO11 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_11 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12,  /* GPIO_EMC_B1_12 is configured as FLEXIO1_FLEXIO12 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_12 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_FLEXIO1_FLEXIO13,  /* GPIO_EMC_B1_13 is configured as FLEXIO1_FLEXIO13 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_13 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_14_FLEXIO1_FLEXIO14,  /* GPIO_EMC_B1_14 is configured as FLEXIO1_FLEXIO14 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_14 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_15_FLEXIO1_FLEXIO15,  /* GPIO_EMC_B1_15 is configured as FLEXIO1_FLEXIO15 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_15 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_16_FLEXIO1_FLEXIO16,  /* GPIO_EMC_B1_16 is configured as FLEXIO1_FLEXIO16 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_16 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_17_FLEXIO1_FLEXIO17,  /* GPIO_EMC_B1_17 is configured as FLEXIO1_FLEXIO17 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_17 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_18_FLEXIO1_FLEXIO18,  /* GPIO_EMC_B1_18 is configured as FLEXIO1_FLEXIO18 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_18 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_19_FLEXIO1_FLEXIO19,  /* GPIO_EMC_B1_19 is configured as FLEXIO1_FLEXIO19 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_19 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00,  /* GPIO_EMC_B1_00 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_01_FLEXIO1_FLEXIO01,  /* GPIO_EMC_B1_01 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02,  /* GPIO_EMC_B1_02 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_03_FLEXIO1_FLEXIO03,  /* GPIO_EMC_B1_03 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_04_FLEXIO1_FLEXIO04,  /* GPIO_EMC_B1_04 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_05_FLEXIO1_FLEXIO05,  /* GPIO_EMC_B1_05 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_06_FLEXIO1_FLEXIO06,  /* GPIO_EMC_B1_06 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_07_FLEXIO1_FLEXIO07,  /* GPIO_EMC_B1_07 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_08_FLEXIO1_FLEXIO08,  /* GPIO_EMC_B1_08 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_09_FLEXIO1_FLEXIO09,  /* GPIO_EMC_B1_09 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_10_FLEXIO1_FLEXIO10,  /* GPIO_EMC_B1_10 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_11_FLEXIO1_FLEXIO11,  /* GPIO_EMC_B1_11 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12,  /* GPIO_EMC_B1_12 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_13_FLEXIO1_FLEXIO13,  /* GPIO_EMC_B1_13 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_14_FLEXIO1_FLEXIO14,  /* GPIO_EMC_B1_14 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_15_FLEXIO1_FLEXIO15,  /* GPIO_EMC_B1_15 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_16_FLEXIO1_FLEXIO16,  /* GPIO_EMC_B1_16 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_17_FLEXIO1_FLEXIO17,  /* GPIO_EMC_B1_17 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_18_FLEXIO1_FLEXIO18,  /* GPIO_EMC_B1_18 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_19_FLEXIO1_FLEXIO19,  /* GPIO_EMC_B1_19 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


